Revit 2026 API

# BuiltInFailuresWallJoinFailures Class

---

Failures about WallJoin.

SystemObject Autodesk.Revit.DBBuiltInFailuresWallJoinFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class WallJoinFailures
```
```vb
Public NotInheritable Class WallJoinFailures
```
```cpp
public ref class WallJoinFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type WallJoinFailures = class end
```

The BuiltInFailuresWallJoinFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FailedToChangeWallJointsTypeFailure | Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed. |

#### Reference

Autodesk.Revit.DB Namespace